a
absolutely
across
afternoon
all
alone
already
always
am
amazing
among
and
angry
anywhere
apple
approximately
april
are
around
artist
ask
august
aunt
autumn
away
awful
back
bad
bag
banana
bank
bathroom
beach
bear
beautiful
bedroom
beige
bend
berry
best
better
between
big
bike
bird
birds
birthday
black
bloom
blue
blueberry
book
books
bottle
bottom
box
brave
bright
brother
brown
c
calm
can
car
care
cat
ceiling
certainly
chair
cherry
chicken
christmas
church
clear
clearly
climb
clock
close
clouds
cloudy
coconut
cold
come
completely
computer
congratulations
cook
cool
cousin
cow
craw
crawl
cup
cute
daily
dance
dark
day
december
definitely
desert
desk
dining
do
doctor
dog
door
down
downstairs
driver
drives
duck
early
eight
eighteen
elephant
eleven
en
enjoy
entirely
even
evening
everywhere
exactly
excellent
excited
excuse
extremely
fairly
fantastic
far
farmer
fast
fat
father
february
few
fifteen
fire
fish
five
float
floor
flowers
fly
foggy
forest
four
fourteen
fox
frequently
friday
friend
friends
front
fun
funny
garage
garden
get
giant
giraffe
give
go
goat
goes
gold
good
goodbye
gr
grab
grandfather
grandmother
grape
gray
great
green
grow
handsome
happy
hard
hate
have
he
hear
heavy
hello
here
hi
high
hold
home
hop
horrible
horse
hospital
hot
house
how
huge
i
ice
in
incredibly
indigo
inside
is
it
january
july
jump
jumps
june
just
kind
kitchen
kiwi
lake
lamp
large
late
later
lazy
left
lemon
library
light
like
lime
lion
listen
little
live
living
long
look
lov
love
lovely
luck
ly
make
mango
many
march
maroon
mat
may
maybe
me
mean
melon
merry
mirror
monday
monkey
monthly
morning
mother
mountain
mouse
moves
museum
musician
name
narrow
navy
near
need
nervous
never
new
nice
night
nine
nineteen
no
november
now
nowhere
nurse
obviously
occasionally
ocean
october
off
office
often
on
one
only
orange
out
outside
over
papaya
paper
park
partly
peach
pear
pen
pencil
perfect
perhaps
phone
picture
pig
pilot
pineapple
pink
plate
please
plum
police
poor
post
prefer
pretty
probably
proud
purple
quick
quite
rabbit
radio
rainy
rarely
raspberry
rather
reach
really
red
restaurant
rich
right
river
roll
roof
room
rough
round
run
sad
saturday
say
scared
school
see
seldom
september
serious
seven
seventeen
she
sheep
shopping
short
shy
side
silly
silver
sister
sits
six
sixteen
skinny
skip
slide
slow
slowly
small
smart
smooth
snowy
soft
some
sometimes
somewhat
somewhere
soon
sorry
speak
spin
spring
station
still
store
stormy
strawberry
stretch
strong
summer
sun
sunday
sunny
surely
swim
t
table
take
talk
tall
tan
teacher
television
tell
ten
terrible
test
thank
that
the
theater
then
there
these
they
thick
thin
thirteen
this
those
three
through
thursday
tiger
tiny
to
today
together
tomorrow
top
totally
trees
tuesday
turn
turquoise
twelve
twenty
twist
two
ugly
uncle
up
upstairs
usually
very
ving
violet
walk
wall
want
warm
was
watch
we
weak
wednesday
weekly
welcome
were
what
when
where
which
white
who
why
wide
will
window
windy
winter
wonderful
words
work
world
yard
year
yearly
yellow
yes
yesterday
yet
you
your
zebra
