a
about
absolutely
across
act
address
afraid
after
afternoon
again
age
ago
air
airport
album
all
alone
along
already
always
am
amazing
among
an
and
angry
animal
answer
any
anywhere
apartment
apple
approximately
april
are
arm
around
arrive
artist
as
ask
at
august
aunt
autumn
away
awful
baby
back
bad
bag
ball
balloon
banana
band
bank
base
basket
bath
bathroom
be
beach
bear
beautiful
because
become
bed
bedroom
before
begin
behind
beige
bell
below
bench
bend
berry
beside
best
better
between
bicycle
big
bike
bird
birds
birthday
black
bloom
blow
blue
blueberry
board
boat
body
book
books
bottle
bottom
bowl
box
boy
brave
bread
break
breakfast
bridge
bright
bring
brother
brown
brush
build
burn
bus
busy
but
butter
button
buy
by
bye
c
cake
calendar
call
calm
camera
camp
can
candle
candy
cap
capital
captain
car
card
care
carry
case
cassette
cat
catch
ceiling
center
certainly
chair
chalk
chance
change
cheap
cheese
cherry
chicken
child
chopstick
christmas
church
circle
city
class
classmate
clean
clear
clearly
climb
clock
close
clothes
cloud
clouds
cloudy
club
coat
coconut
coffee
coin
cold
color
come
completely
computer
congratulations
cook
cool
copy
corner
count
country
course
cousin
cover
cow
craw
crawl
crayon
cream
cross
cry
cup
curtain
cut
cute
dad
daily
dance
danger
dark
date
daughter
day
dead
dear
december
deep
definitely
desert
desk
dial
diary
dictionary
die
dining
dinner
dirty
dish
do
doctor
dog
doll
dollar
dolphin
door
down
downstairs
draw
dream
dress
drink
drive
driver
drives
drop
drum
dry
duck
dy
ear
early
earth
east
easy
eat
egg
eight
eighteen
elephant
eleven
empty
en
end
engine
enjoy
enough
entirely
eraser
even
evening
every
everywhere
exactly
example
excellent
excite
excited
excuse
exellent
exercise
extremely
eye
f
face
fact
fair
fairly
fall
family
famous
fantastic
far
farm
farmer
fast
fat
father
february
feel
few
field
fifteen
fight
fill
film
find
fine
finger
finish
fire
fish
five
fix
flag
float
floor
flower
flowers
fly
foggy
follow
food
fool
foot
for
forest
forget
fork
four
fourteen
fox
free
frequently
fresh
friday
friend
friends
from
front
fruit
full
fun
funny
game
garage
garden
gas
gate
gentle
get
giant
giraffe
girl
give
glad
glass
glove
go
goat
god
goes
gold
good
goodbye
gr
grab
grandfather
grandmother
grape
grass
gray
great
green
ground
group
grow
guitar
hair
half
hall
hamburger
hand
handle
handsome
happen
happy
hard
hat
hate
have
he
head
hear
heart
heavy
hello
help
hen
here
hi
hide
high
hiking
hill
hit
hold
hole
holiday
home
hop
hope
horrible
horse
hose
hospital
hot
hotel
hour
house
how
huge
hundred
hungry
hurry
hurt
i
ice
idea
if
il
ill
in
incredibly
indigo
ink
inside
interest
into
introduce
is
island
it
january
job
join
juice
july
jump
jumps
june
jungle
just
keep
key
kick
kid
kill
kind
king
kitchen
kiwi
knee
knife
knock
know
lady
lake
lamp
land
large
last
late
later
laugh
lazy
lead
leaf
learn
leave
left
leg
lemon
lesson
let
letter
library
lie
light
like
lime
line
lion
lip
list
listen
little
live
living
long
look
lose
lot
loud
lov
love
lovely
low
luck
lunch
ly
ma
ma'am
mad
mail
make
man
mango
many
map
march
market
maroon
marry
mat
matter
may
maybe
me
mean
meat
medal
meet
melon
mera
merry
meter
middle
milk
million
minute
mirror
miss
model
mom
monday
money
monkey
month
monthly
moon
morning
mother
mountain
mouse
mouth
move
moves
movie
mr
mrs
much
museum
music
musician
must
my
name
narrow
navy
near
neck
need
nervous
never
new
news
next
nice
night
nine
nineteen
no
noise
north
nose
not
note
november
now
nowhere
number
nurse
o
o'clock
obviously
occasionally
ocean
october
of
off
office
often
oh
oil
oise
ok
okay
old
on
once
one
only
open
or
orange
other
out
outside
over
page
paint
pair
pants
papaya
paper
pardon
parent
park
partly
party
pass
pay
peace
peach
pear
pen
pencil
people
perfect
perhaps
phone
piano
pick
picnic
picture
piece
pig
pilot
pin
pine
pineapple
pink
pipe
place
plan
plane
plant
plate
play
please
plum
pocket
point
police
pool
poor
post
postato
poster
practice
prefer
present
pretty
print
probably
problem
proud
pull
purple
push
put
queen
question
quick
quiet
quite
rabbit
radio
rain
rainbow
rainy
rarely
raspberry
rather
reach
read
ready
real
really
record
red
remember
repeat
rest
restaurant
return
ribbon
rice
rich
ride
right
ring
river
road
robot
rock
rocket
roll
roof
room
rose
rough
round
ruler
run
sad
safe
salad
salt
same
sand
saturday
say
scared
school
score
sea
season
seat
see
seldom
sell
send
september
serious
service
set
seven
seventeen
shall
shape
she
sheep
sheet
ship
shirt
shoe
shoot
shop
shopping
short
shoulder
shout
show
shower
shut
shy
sick
side
sign
silly
silver
sing
sir
sister
sit
sits
six
sixteen
size
skate
skinny
skip
skirt
sky
sleep
slide
slow
slowly
small
smart
smell
smile
smoke
smooth
snow
snowy
so
soap
soccer
sock
soft
some
sometimes
somewhat
somewhere
son
song
soon
sorry
sound
soup
south
space
speak
speed
spell
spend
spin
spoon
sport
spring
square
stairs
stamp
stand
star
start
station
stay
steam
step
stick
still
stone
stop
store
storm
stormy
story
stove
straight
strange
straw
strawberry
street
stretch
strike
strong
student
study
stupid
subway
sugar
summer
sun
sunday
sunny
supermarket
supper
sure
surely
surprise
sweater
sweet
swim
swing
switch
t
table
take
talk
tall
tan
tape
taste
taxi
tea
teach
teacher
team
telephone
television
tell
temple
ten
tennis
terrible
test
th
than
thank
that
the
theater
then
there
these
they
thick
thin
thing
think
thirsty
thirteen
this
those
thousand
three
through
throw
thursday
ticket
tie
tiger
till
time
tiny
tired
to
today
together
tomato
tomorrow
tonight
too
tooth
top
totally
touch
town
toy
train
travel
tree
trees
trip
truck
true
try
tuesday
tulip
turn
turquoise
twelve
twenty
twice
twist
two
ugly
umbrella
uncle
under
understand
until
up
upstairs
use
usual
usually
vacation
vegetable
very
video
village
ving
violet
violin
visit
wait
wake
walk
wall
want
war
warm
was
wash
waste
watch
water
way
we
weak
wear
weather
wednesday
week
weekly
welcome
well
were
west
wet
what
when
where
which
white
who
why
wide
will
win
wind
window
windy
wing
winter
with
woman
wonder
wonderful
wood
word
words
work
world
write
wrong
yard
yeah
year
yearly
yellow
yes
yesterday
yet
you
young
your
zebra
zero
zoo
