a
ability
able
absent
accept
accident
across
action
activity
add
address
adult
afraid
against
airport
alike
allowance
along
amazing
ancestor
and
angry
ankle
anniversary
another
answer
apologize
apply
appreciate
architect
arm
arrive
artist
ask
at
attend
attention
attic
aunt
author
away
back
backpack
badly
bake
bakery
balance
bald
ballon
bank
bark
baseball
basement
basketball
be
beach
beard
beast
beautiful
beauty
begin
believe
belly
belt
bend
best
between
bill
birth
birthday
bitter
blackboard
blanket
blind
block
bloom
blow
board
boil
bone
boot
boring
borrow
bother
bottle
bow
bowl
branch
brand
brave
break
breakfast
breathe
breeze
bridge
bright
brilliant
bring
brush
building
burn
bush
buy
cafeteria
call
cameo
cancer
cap
card
care
career
careful
carry
cash
cashier
catch
cats
cause
celebrate
challenge
champion
change
character
chat
cheap
checked
cheek
cheer
chef
chest
chic
child
chin
choice
choir
choose
chop
chopsticks
city
classroom
clear
clerk
clever
climate
climb
close
closet
clothes
cloud
coach
coin
cold
collect
colorful
come
comfortable
communicate
company
complain
composer
condition
confident
contest
cook
corner
correct
cost
costume
couch
cough
counselor
country
couple
cousin
cowardly
craft
creative
credit
cross
crosswalk
crowd
cry
culture
cure
curious
curly
curve
customer
cut
dance
dangerous
dark
daughter
day
deaf
death
decide
decision
decorate
deep
delicious
delight
deliver
dentist
depart
department
desert
dessert
destroy
detective
die
different
difficult
diligent
disabled
disappear
disappointed
discount
disease
dishes
distant
do
dogs
domestic
donate
down
draw
drawer
dress
drink
drive
drop
drought
dry
dull
during
dust
e
each
easter
easy
elbow
elderly
elect
elementary
emergency
empty
enemy
enjoy
enter
event
exam
excellent
exchange
exciting
excuse
exercise
exhibit
exhibition
exit
expect
expensive
experience
explain
explore
express
eyebrow
eyelid
face
factory
fail
fair
fall
family
famous
fan
fantastic
far
farewell
farmer
fashion
fasten
favor
favorite
feather
feed
fellow
festival
fever
fiction
field
fight
fill
filled
final
find
finger
finish
fire
fireplace
firework
fit
flat
flavor
flight
flood
floor
flour
flower
fog
fold
follow
foot
for
forecast
forehead
foreign
forest
forget
forgive
free
freeze
fresh
friendly
friendship
frightened
from
front
frown
full
fun
fur
furniture
future
garage
garden
gate
gather
generous
get
gift
glad
glasses
gloves
go
goalkeeper
going
good
goods
gossip
grab
grade
grandchild
grandparents
grass
grateful
greet
grocery
group
grow
growl
guest
gym
habit
half
hands
hang
happen
happiness
harvest
hate
have
headache
heal
health
heat
heavily
heel
help
helpful
hibition
highway
hike
hobby
hold
holiday
holloween
homework
honest
hopeful
horror
hospital
host
housework
huge
humid
hunt
hurricane
hurt
husband
icy
ill
imagine
important
impossible
improve
in
information
injure
inside
interest
interested
interview
introduce
inventor
invite
island
jacket
jealous
job
jog
join
joke
judge
jump
keep
kettle
kick
kill
kind
kindness
kitchen
knee
knife
lake
large
late
laugh
laundry
lawn
lawyer
lay
lazy
learn
leave
left
leg
lend
lesson
let
letter
library
lie
life
lift
light
lightning
like
lip
list
listen
live
living
lonely
long
look
loose
lose
lovely
low
luck
lucky
make
male
manners
marathon
market
marry
match
math
meal
meat
medicine
melt
member
mental
mention
messy
mild
minded
miracle
mirror
miss
mistake
mix
model
money
mop
move
movie
muscle
museum
name
narrow
national
nature
near
neat
necessary
neck
need
nephew
nervous
nest
new
nickname
niece
nod
noise
noodle
nose
note
number
of
off
office
on
one
one's
open
operation
opinion
orchestra
other
out
outgoing
outside
over
p
pain
paint
pair
palm
pants
parents
park
parrot
pass
passenger
passport
pastime
pat
patient
pay
peace
peel
penalty
pepper
perfect
perform
performance
pharmacy
photographer
physical
pick
picnic
picture
piece
pillow
pilot
pity
plan
plant
plate
play
playground
pleasant
pleased
pleasure
pocket
point
polite
ponytail
popular
porch
pork
post
pot
pour
practice
prefer
prepare
president
press
pretty
prevent
price
principal
prize
problem
professor
proud
provide
pull
pumpkin
punish
push
put
quarrel
question
quickly
quiet
quite
rain
raincoat
raise
reach
ready
recipe
recommend
recover
referee
refrigerator
refuse
regular
rehearsal
relative
relax
remember
repair
repeat
reporter
request
resemble
reservation
reserve
rest
restaurant
review
ride
river
road
role
romance
roof
root
rope
rug
runny
s
sadness
safe
salty
same
satisfied
scenery
schedule
school
science
scientist
score
search
season
secret
seed
sell
send
senior
serve
set
shake
share
sharp
shelf
shine
shoot
shopping
shorts
shoulder
shower
sick
sight
silent
similar
single
size
sketch
skill
skin
skinny
skirt
slide
smart
smell
smile
smooth
snack
sneakers
snowy
soccer
socks
soil
soldier
solve
sore
sorrowful
sorry
sour
special
speech
speed
spell
spend
spicy
spoil
sports
spread
stage
stair
start
station
stay
stir
stop
store
storm
straight
strange
stream
street
stress
stretch
striped
study
stupid
style
subject
subway
succeed
suddenly
suffer
sugar
suggest
summer
sunshine
support
sure
surgeon
surprised
sweat
sweater
sweep
sweet
swim
swimming
table
tail
take
talent
task
taste
tax
teach
teacher
team
tear
tease
tell
temperature
tennis
terrible
terrific
textbook
thank
thanksgiving
the
theater
theme
thick
thigh
thin
think
throat
throw
thunder
ticket
tie
tight
time
to
toe
together
tongue
tooth
toothache
topic
touched
tour
town
trade
tradition
traffic
transfer
travel
treat
trip
true
trust
try
turkey
turn
twin
ugly
umbrella
uncle
understand
uniform
unique
unit
unkind
upset
upstairs
use
useful
vacation
vegetable
victory
visa
visit
voice
volleyball
volunteer
wag
waist
wait
walk
want
warm
wash
watch
weak
wear
weather
wedding
weed
welcome
wet
whale
wide
wild
win
window
windy
wing
winter
wipe
wise
witch
with
work
worried
worry
wound
wrap
wrinkle
write
wrong
yard
